
let number = new Map;
number.set('1', 'один')
        .set('2', 'два')
        .set('3', 'три')
        .set('4', 'четыре')
        .set('5', 'пять')
        .set('6', 'шесть')
        .set('7', 'семь')
        .set('8', 'восемь')
        .set('9', 'девять')
        .set('0', 'ноль')

let range = ['тысяча', 'тысяч', 'девятьсот', 'восемьсот', 'семьсот', 'шестьсот', 'пятьсот', 'четыреста',
             'триста', 'двести', 'сто', 'девяносто', 'восемьдесят', 'семьдесят','шестьдесят','пятьдесят',
             'сорок','тридцать','двадцать','девятнадцать','восемнадцать','семнадцать','шестнадцать',
             'пятнадцать','четырнадцать','тринадцать','двенадцать','одинадцать','десять',];